[
  {
    "URL": "https://api.semanticscholar.org/CorpusID:7260137",
    "author": [
      {
        "family": "Burley",
        "given": "Brent"
      }
    ],
    "id": "Burley2012",
    "issued": {
      "date-parts": [
        [
          2012
        ]
      ]
    },
    "title": "Physically-based shading at disney",
    "type": "paper-conference"
  },
  {
    "URL": "https://nvlpubs.nist.gov/nistpubs/jres/53/jresv53n2p113_A1b.pdf",
    "author": [
      {
        "dropping-particle": "ph",
        "family": "Stair",
        "given": "Ral"
      },
      {
        "dropping-particle": ".",
        "family": "Johnston",
        "given": "Russell G"
      },
      {
        "dropping-particle": ".",
        "family": "Bagg",
        "given": "Thomas C"
      }
    ],
    "container-title": "Journal of Research of the National Bureau of Standards",
    "id": "Stair1954",
    "issue": "2",
    "issued": {
      "date-parts": [
        [
          1954
        ]
      ]
    },
    "title": "Spectral distribution of energy from the sun",
    "type": "article-journal",
    "volume": "53"
  },
  {
    "URL": "https://www.oceanopticsbook.info/",
    "author": [
      {
        "family": "Mobley",
        "given": "Curtis"
      }
    ],
    "id": "Mobley2021",
    "issued": {
      "date-parts": [
        [
          2021,
          5
        ]
      ]
    },
    "title": "Ocean optics web book",
    "type": "book"
  },
  {
    "DOI": "10.1364/JOSA.40.000055",
    "URL": "https://opg.optica.org/abstract.cfm?URI=josa-40-1-55",
    "abstract": "A theory is developed by which diffuse reflection from dielectric surfaces may be studied by measuring the polarization of the light diffusely reflected from such surfaces. Observations of the ratio of the intensities of light vibrating parallel to and perpendicular to the plane of incidence indicate that for ground and etched glass surfaces, illuminated by a collimated beam, regular reflection from small mirror-like planes, oriented at random, is responsible for much of the diffuse reflection.",
    "author": [
      {
        "family": "Rense",
        "given": "William A."
      }
    ],
    "container-title": "J. Opt. Soc. Am.",
    "id": "Rense1950",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          1950,
          1
        ]
      ]
    },
    "keyword": "Fresnel reflection; Light intensity; Molecular scattering; Polarized light; Reflection; White light",
    "page": "55-59",
    "publisher": "Optica Publishing Group",
    "title": "Polarization studies of light diffusely reflected from ground and etched glass surfaces",
    "type": "article-journal",
    "volume": "40"
  },
  {
    "DOI": "10.1364/JOSA.57.001105",
    "URL": "https://opg.optica.org/abstract.cfm?URI=josa-57-9-1105",
    "abstract": "The directional distribution of radiant flux reflected from roughened surfaces is analyzed on the basis of geometrical optics. The analytical model assumes that the surface consists of small, randomly disposed, mirror-like facets. Specular reflection from these facets plus a diffuse component due to multiple reflections and/or internal scattering are postulated as the basic mechanisms of the reflection process. The effects of shadowing and masking of facets by adjacent facets are included in the analysis. The angular distributions of reflected flux predicted by the analysis are in very good agreement with experiment for both metallic and nonmetallic surfaces. Moreover, the analysis successfully predicts the off-specular maxima in the reflection distribution which are observed experimentally and which emerge as the incidence angle increases. The model thus affords a rational explanation for the off-specular peak phenomenon in terms of mutual masking and shadowing of mirror-like, specularly reflecting surface facets.",
    "author": [
      {
        "family": "Torrance",
        "given": "K. E."
      },
      {
        "family": "Sparrow",
        "given": "E. M."
      }
    ],
    "container-title": "J. Opt. Soc. Am.",
    "id": "Torrance1967",
    "issue": "9",
    "issued": {
      "date-parts": [
        [
          1967,
          9
        ]
      ]
    },
    "keyword": "Bidirectional reflectance distribution function; Fresnel reflection; Geometric optics; Material properties; Reflection; Refractive index",
    "page": "1105-1114",
    "publisher": "Optica Publishing Group",
    "title": "Theory for off-specular reflection from roughened surfaces\\ast",
    "type": "article-journal",
    "volume": "57"
  },
  {
    "DOI": "10.1145/1122501.1122502",
    "author": [
      {
        "family": "Edwards",
        "given": "David"
      },
      {
        "family": "Boulos",
        "given": "Solomon"
      },
      {
        "family": "Johnson",
        "given": "Jared"
      },
      {
        "family": "Shirley",
        "given": "Peter"
      },
      {
        "family": "Ashikhmin",
        "given": "Michael"
      },
      {
        "family": "Stark",
        "given": "Michael"
      },
      {
        "family": "Wyman",
        "given": "Chris"
      }
    ],
    "container-title": "ACM Trans. Graph.",
    "id": "Edwards2006",
    "issued": {
      "date-parts": [
        [
          2006,
          1
        ]
      ]
    },
    "page": "1-18",
    "title": "The halfway vector disk for BRDF modeling",
    "type": "article-journal",
    "volume": "25"
  },
  {
    "DOI": "10.1109/TAP.1967.1138991",
    "author": [
      {
        "family": "Smith",
        "given": "B."
      }
    ],
    "container-title": "IEEE Transactions on Antennas and Propagation",
    "id": "Smith1967",
    "issue": "5",
    "issued": {
      "date-parts": [
        [
          1967
        ]
      ]
    },
    "page": "668-671",
    "title": "Geometrical shadowing of a random rough surface",
    "type": "article-journal",
    "volume": "15"
  },
  {
    "URL": "https://www.gdcvault.com/play/1024478/PBR-Diffuse-Lighting-for-GGX",
    "author": [
      {
        "family": "Earl Hammon",
        "given": "Jr."
      }
    ],
    "id": "Hammon2017",
    "issued": {
      "date-parts": [
        [
          2017
        ]
      ]
    },
    "note": "Game Developers Conference",
    "title": "PBR diffuse lighting for GGX+smith microsurfaces",
    "type": "manuscript"
  },
  {
    "ISBN": "9783905673524",
    "abstract": "Microfacet models have proven very successful for modeling light reflection from rough surfaces. In this paper we review microfacet theory and demonstrate how it can be extended to simulate transmission through rough surfaces such as etched glass. We compare the resulting transmission model to measured data from several real surfaces and discuss appropriate choices for the microfacet distribution and shadowing-masking functions. Since rendering transmission through media requires tracking light that crosses at least two interfaces, good importance sampling is a practical necessity. Therefore, we also describe efficient schemes for sampling the microfacet models and the corresponding probability density functions.",
    "author": [
      {
        "family": "Walter",
        "given": "Bruce"
      },
      {
        "family": "Marschner",
        "given": "Stephen R."
      },
      {
        "family": "Li",
        "given": "Hongsong"
      },
      {
        "family": "Torrance",
        "given": "Kenneth E."
      }
    ],
    "collection-title": "EGSR’07",
    "container-title": "Proceedings of the 18th eurographics conference on rendering techniques",
    "id": "Walter2007",
    "issued": {
      "date-parts": [
        [
          2007
        ]
      ]
    },
    "keyword": "refraction, microfacet BTDF, global illumination, cook-torrance model, Monte Carlo sampling",
    "page": "195-206",
    "publisher": "Eurographics Association",
    "publisher-place": "Goslar, DEU",
    "title": "Microfacet models for refraction through rough surfaces",
    "type": "paper-conference"
  },
  {
    "URL": "https://jcgt.org/published/0003/02/03/paper.pdf",
    "author": [
      {
        "family": "Heitz",
        "given": "Eric"
      }
    ],
    "collection-number": "2",
    "container-title": "Journal of Computer Graphics Techniques",
    "id": "Heitz2014",
    "issued": {
      "date-parts": [
        [
          2014
        ]
      ]
    },
    "title": "Understanding the masking-shadowing function in microfacet-based BRDFs",
    "type": "paper-conference",
    "volume": "3"
  },
  {
    "DOI": "10.1145/2407783.2407791",
    "ISBN": "9781450319133",
    "URL": "https://doi.org/10.1145/2407783.2407791",
    "abstract": "In Computer Graphics, the polarisation properties of light currently play a role in several contexts: in certain forms of highly realistic ray-based image synthesis (sometimes colloquially referred to as Polarisation Ray Tracing), in some 3D display systems, and in some material acquisition technologies. The properties of light that are behind all of these applications are basically the same, although the technologies for which this property of light is being used differ considerably. Also, the notations and mathematical formalisms used in these application areas differ to some degree as well. This course aims to provide a unified resource for those areas of computer graphics which require a working knowledge of light polarisation: rendering and material acquisition. Consequently, the course is structured into three main parts: I - Background, II - Polarisation Ray Tracing, and III - Polarised Light in Acquisition Technology. Care is taken so that the information provided in Part I is applicable to both Part II and III of the course, and is formulated in a way that emphasises the underlying similarities.",
    "author": [
      {
        "family": "Wilkie",
        "given": "Alexander"
      },
      {
        "family": "Weidlich",
        "given": "Andrea"
      }
    ],
    "collection-title": "SA ’12",
    "container-title": "SIGGRAPH asia 2012 courses",
    "id": "Wilkie2012",
    "issued": {
      "date-parts": [
        [
          2012
        ]
      ]
    },
    "publisher": "Association for Computing Machinery",
    "publisher-place": "New York, NY, USA",
    "title": "Polarised light in computer graphics",
    "type": "paper-conference"
  },
  {
    "DOI": "10.1145/192161.192213",
    "ISBN": "0897916670",
    "URL": "https://doi.org/10.1145/192161.192213",
    "abstract": "Lambert’s model for body reflection is widely used in computer graphics. It is used extensively by rendering techniques such as radiosity and ray tracing. For several real-world objects, however, Lambert’s model can prove to be a very inaccurate approximation to the body reflectance. While the brightness of a Lambertian surface is independent of viewing direction, that of a rough surface increases as the viewing direction approaches the light source direction. In this paper, a comprehensive model is developed that predicts body reflectance from rough surfaces. The surface is modeled as a collection of Lambertian facets. It is shown that such a surface is inherently non-Lambertian due to the foreshortening of the surface facets. Further, the model accounts for complex geometric and radiometric phenomena such as masking, shadowing, and interreflections between facets. Several experiments have been conducted on samples of rough diffuse surfaces, such as, plaster, sand, clay, and cloth. All these surface demonstrate significant deviation from Lambertian behavior. The reflectance measurements obtained are in strong agreement with the reflectance predicted by the model.",
    "author": [
      {
        "family": "Oren",
        "given": "Michael"
      },
      {
        "family": "Nayar",
        "given": "Shree K."
      }
    ],
    "collection-title": "SIGGRAPH ’94",
    "container-title": "Proceedings of the 21st annual conference on computer graphics and interactive techniques",
    "id": "Oren1994",
    "issued": {
      "date-parts": [
        [
          1994
        ]
      ]
    },
    "keyword": "BRDF, reflection models, Lambert’s model, rough surfaces, moon reflectance",
    "page": "239-246",
    "publisher": "Association for Computing Machinery",
    "publisher-place": "New York, NY, USA",
    "title": "Generalization of lambert’s reflectance model",
    "type": "paper-conference"
  },
  {
    "DOI": "https://doi.org/10.1111/1467-8659.1330233",
    "URL": "https://onlinelibrary.wiley.com/doi/abs/10.1111/1467-8659.1330233",
    "abstract": "Abstract: A new BRDF model is presented which can be viewed as an kind of intermediary model between empirism and theory. Main results of physics are observed (energy conservation, reciprocity rule, microfacet theory) and numerous phenomena involved in light reflection are accounted for, in a physically plausible way (incoherent and coherent reflection, spectrum modifications, anisotropy, self-shadowing, multiple surface and subsurface reflection, differences between homogeneous and heterogeneous materials). The model has been especially intended for computer graphics applications and therefore includes two main features: simplicity (a small number of intuitively understandable parameters controls the model) and efficiency (the formulation provides adequation to Monte-Carlo rendering techniques and/or hardware implementations).",
    "author": [
      {
        "family": "Schlick",
        "given": "Christophe"
      }
    ],
    "container-title": "Computer Graphics Forum",
    "id": "Schlick1994",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          1994
        ]
      ]
    },
    "keyword": "Physically-Based Rendering, Bidirectional Reflectance Distribution Function, Optimization",
    "page": "233-246",
    "title": "An inexpensive BRDF model for physically-based rendering",
    "type": "article-journal",
    "volume": "13"
  }
]
